section1/perf/results/heavy/gunicorn_load_output.txt
> perf@1.0.0 artillery /home/tony/Desktop/tp1arqsoft/perf
> artillery "run" "heavy.yaml" "-e" "gunicorn"

Started phase 0 (Ramp_1), duration: 10s @ 17:32:28(-0300) 2020-11-10
Report @ 17:32:38(-0300) 2020-11-10
Elapsed time: 10 seconds
  Scenarios launched:  46
  Scenarios completed: 2
  Requests completed:  2
  Mean response/sec: 5.15
  Response time (msec):
    min: 3006.4
    max: 5957.7
    median: 4482
    p95: 5957.7
    p99: 5957.7
  Codes:
    200: 2

Started phase 1 (Ramp_2), duration: 10s @ 17:32:39(-0300) 2020-11-10
Report @ 17:32:48(-0300) 2020-11-10
Elapsed time: 20 seconds
  Scenarios launched:  144
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 14.41
  Response time (msec):
    min: 7664.2
    max: 14868.2
    median: 11165.9
    p95: 14868.2
    p99: 14868.2
  Codes:
    200: 4

Started phase 2 (Ramp_3), duration: 10s @ 17:32:49(-0300) 2020-11-10
Report @ 17:32:58(-0300) 2020-11-10
Elapsed time: 30 seconds
  Scenarios launched:  233
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 23.32
  Response time (msec):
    min: 17767.6
    max: 22871.3
    median: 20370.3
    p95: 22871.3
    p99: 22871.3
  Codes:
    200: 3

Started phase 3 (Ramp_4), duration: 10s @ 17:33:00(-0300) 2020-11-10
Report @ 17:33:08(-0300) 2020-11-10
Elapsed time: 40 seconds
  Scenarios launched:  339
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 34
  Response time (msec):
    min: 25672.2
    max: 31473
    median: 28574.1
    p95: 31473
    p99: 31473
  Codes:
    200: 3
  Errors:
    ECONNRESET: 239

Started phase 4 (Ramp_5), duration: 10s @ 17:33:10(-0300) 2020-11-10
Report @ 17:33:18(-0300) 2020-11-10
Elapsed time: 50 seconds
  Scenarios launched:  431
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 43.1
  Response time (msec):
    min: 34375.4
    max: 42878.7
    median: 38577.3
    p95: 42878.7
    p99: 42878.7
  Codes:
    200: 4
  Errors:
    ECONNRESET: 427

Started phase 5 (Ramp_6), duration: 10s @ 17:33:20(-0300) 2020-11-10
Report @ 17:33:28(-0300) 2020-11-10
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  545
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: 54.55
  Response time (msec):
    min: 45580.6
    max: 51282.4
    median: 48478.9
    p95: 51282.4
    p99: 51282.4
  Codes:
    200: 3
  Errors:
    ECONNRESET: 542

Started phase 6 (Ramp_7), duration: 10s @ 17:33:30(-0300) 2020-11-10
Report @ 17:33:38(-0300) 2020-11-10
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  638
  Scenarios completed: 27
  Requests completed:  27
  Mean response/sec: 63.86
  Response time (msec):
    min: 54183.4
    max: 60025.8
    median: 60001.5
    p95: 60008.7
    p99: 60025.8
  Codes:
    200: 3
    504: 24
  Errors:
    ECONNRESET: 610

Started phase 7 (Ramp_8), duration: 10s @ 17:33:40(-0300) 2020-11-10
Report @ 17:33:48(-0300) 2020-11-10
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  724
  Scenarios completed: 144
  Requests completed:  144
  Mean response/sec: 72.47
  Response time (msec):
    min: 59997.1
    max: 60026.7
    median: 60000.7
    p95: 60004.1
    p99: 60008.2
  Codes:
    504: 144
  Errors:
    ECONNRESET: 581

Started phase 8 (Ramp_9), duration: 10s @ 17:33:50(-0300) 2020-11-10
Report @ 17:33:58(-0300) 2020-11-10
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  829
  Scenarios completed: 233
  Requests completed:  233
  Mean response/sec: 82.8
  Response time (msec):
    min: 59997
    max: 60024.3
    median: 60001.1
    p95: 60003.9
    p99: 60005
  Codes:
    504: 233
  Errors:
    ECONNRESET: 596

Started phase 9 (Ramp_10), duration: 10s @ 17:34:00(-0300) 2020-11-10
Report @ 17:34:08(-0300) 2020-11-10
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  928
  Scenarios completed: 100
  Requests completed:  100
  Mean response/sec: 92.99
  Response time (msec):
    min: 59997.5
    max: 60032.4
    median: 60001.6
    p95: 60004.1
    p99: 60020.4
  Codes:
    504: 100
  Errors:
    ECONNRESET: 827

Report @ 17:34:18(-0300) 2020-11-10
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  223
  Scenarios completed: 4
  Requests completed:  4
  Mean response/sec: 22.32
  Response time (msec):
    min: 60002.2
    max: 60004.9
    median: 60004.1
    p95: 60004.9
    p99: 60004.9
  Codes:
    504: 4
  Errors:
    ECONNRESET: 223

Report @ 17:34:28(-0300) 2020-11-10
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 3
  Requests completed:  3
  Mean response/sec: NaN
  Response time (msec):
    min: 60000.7
    max: 60004
    median: 60003.5
    p95: 60004
    p99: 60004
  Codes:
    504: 3

Report @ 17:34:38(-0300) 2020-11-10
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 27
  Requests completed:  27
  Mean response/sec: NaN
  Response time (msec):
    min: 59999
    max: 60005.4
    median: 60001.7
    p95: 60005.2
    p99: 60005.4
  Codes:
    504: 27

Report @ 17:34:48(-0300) 2020-11-10
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 144
  Requests completed:  144
  Mean response/sec: NaN
  Response time (msec):
    min: 59997.8
    max: 60009.6
    median: 60001.5
    p95: 60004.6
    p99: 60006
  Codes:
    504: 144

Report @ 17:34:58(-0300) 2020-11-10
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 232
  Requests completed:  232
  Mean response/sec: NaN
  Response time (msec):
    min: 59998.8
    max: 60027.3
    median: 60004
    p95: 60011.1
    p99: 60018.2
  Codes:
    504: 232

Report @ 17:35:08(-0300) 2020-11-10
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 101
  Requests completed:  101
  Mean response/sec: NaN
  Response time (msec):
    min: 59999.5
    max: 60053.2
    median: 60003.9
    p95: 60011.7
    p99: 60045.2
  Codes:
    504: 101

Report @ 17:35:08(-0300) 2020-11-10
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 1
  Requests completed:  1
  Mean response/sec: NaN
  Response time (msec):
    min: 60007.3
    max: 60007.3
    median: 60007.3
    p95: 60007.3
    p99: 60007.3
  Codes:
    504: 1

All virtual users finished
Summary report @ 17:35:08(-0300) 2020-11-10
  Scenarios launched:  5080
  Scenarios completed: 1035
  Requests completed:  1035
  Mean response/sec: 31.89
  Response time (msec):
    min: 3006.4
    max: 60053.2
    median: 60002
    p95: 60007
    p99: 60015.4
  Scenario counts:
    Heavy (/heavy): 5080 (100%)
  Codes:
    200: 22
    504: 1013
  Errors:
    ECONNRESET: 4045